app/controllers/posts_controller.rb

	def index
		@post = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC